"""
### 4. Представлен список чисел. Необходимо вывести те его элементы,
значения которых больше предыдущего, например:

src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
result = [12, 44, 4, 10, 78, 123]
```
Подсказка: использовать возможности python, изученные на уроке.
"""
src = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]

res_list = [src[i + 1] for i in range(len(src) - 1)  if src[i] < src[i + 1]] #побьйеда)
print("result = ", res_list, "(type = list) \n")

print("как можно сделать оптимизацию кода по памяти, по скорости:\n")
res_list_gen = (src[i + 1] for i in range(len(src) - 1)  if src[i] < src[i + 1])
for i in range(0, 7):
    print(next(res_list_gen))

